Tekla.Structures.Internal.TeklaProcessExecuter
Process executer for tekla structures, it allows to search for ApplicationExe files when these are moved from environment to isolated areas - to keep existing macros working
Its expected that the macros will be patched and all Process classes used in macros be replaced with this class

Tekla.Structures.Internal.TeklaProcessExecuter.Start(System.String)
start with arguments
arguments: args

Tekla.Structures.Internal.TeklaProcessExecuter.Start
start

Tekla.Structures.Internal.TeklaProcessExecuter.Start(System.String,System.String)
start with program and arguments
program: program
args: args
Returns: true or false

Tekla.Structures.Internal.TeklaProcessExecuter.Start(System.Diagnostics.ProcessStartInfo)
overrides the main process start
startInfo:
Returns:

Tekla.Structures.Internal.TeklaProcessExecuter.RecurseToEnvironmentsFolder(System.String,System.String,System.String)
recurses to sub parent and seachs for the exe in all sub folders, it stops if the exe is found or we reach the sub parent
toSubParent: until subparent to follow
sourcePath: start folder
fileName: file exe
Returns: empty or a full path of folder

Tekla.Structures.Internal.TeklaProcessExecuter.GetSourceDirectory
gets the source macro that called the process
after this in case we dont find the exe, we can go up the folder until the extension base folder and search for the exe
Returns: